tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "Goles/battery"
brew "mas"

brew "git"
brew "cmake"
brew "fzf"
brew "go"
brew "jrnl"
brew "mysql"
brew "nodejs"
brew "nodenv"
brew "nodenv/nodenv/nodenv-default-packages"
brew "postgresql"
brew "prettier"
brew "python"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "the_silver_searcher"
brew "spark"
brew "battery"
brew "reattach-to-user-namespace" # To support tmux
brew "tldr"
brew "tmux"
brew "vim"

cask_args appdir: "/Applications"
cask "1password-beta"
cask "basecamp"
cask "choosy"
cask "coderunner"
cask "docker"
cask "fantastical"
cask "firefox-developer-edition"
cask "gpg-suite"
cask "iterm2"
cask "kaleidoscope"
cask "keybase"
cask "launchbar"
cask "mailmate"
cask "marked"
cask "monodraw"
cask "mosaic"
cask "notion"
cask "paw"
cask "rocket"
cask "slack"
cask "tableplus"
cask "tower"
cask "transmit"
cask "zoom"

mas "Base", id: 402383384
mas "Better", id: 1121192229
mas "Paprika", id: 1303222628
mas "PCalc", id: 403504866
mas "PrettyJSON for Xcode", id: 1396408074 
mas "Xcode", id: 497799835

# Fonts
cask "font-source-sans-pro"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
