brew "mas"

brew "git"
brew "cmake"
brew "earthly"
brew "fzf"
brew "go"
brew "gpg"
brew "pinentry-mac"
brew "jrnl"
brew "mysql"
brew "node"
brew "nodenv"
brew "nodenv/nodenv/nodenv-default-packages"
brew "postgresql"
brew "prettier"
brew "python"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "the_silver_searcher"
brew "spark"
brew "reattach-to-user-namespace" # To support tmux
brew "hashicorp/tap/terraform"
brew "tldr"
brew "tmux"
brew "vim"

cask_args appdir: "/Applications"
cask "bunch"
cask "choosy"
cask "coderunner"
cask "docker"
cask "fantastical"
cask "firefox@developer-edition"
cask "gpg-suite"
cask "iterm2"
cask "kaleidoscope"
cask "launchbar"
cask "mailmate"
cask "marked"
cask "markedit"
cask "monodraw"
cask "mosaic"
cask "notion"
cask "rapidapi"
cask "quitter"
cask "rocket"
cask "slack"
cask "tableplus"
cask "tower"
cask "transmit"
cask "zoom"

mas "PCalc", id: 403504866
mas "PrettyJSON for Xcode", id: 1396408074
#mas "Xcode", id: 497799835

# Fonts
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"

