brew "fzf"
brew "mysql"
brew "node"
brew "postgresql"
brew "prettier"
brew "rbenv"
brew "redis"
brew "ruby"
brew "ruby-build"
brew "the_silver_searcher"
brew "spark"
tap  "Goles/battery"
brew "battery"
brew "reattach-to-user-namespace" # To support tmux
brew "tmux"
brew "universal-ctags"
brew "vim"
